package app.test.shayariapp;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.View;
import android.view.WindowManager;
import android.widget.ImageButton;
import android.widget.ImageView;
import android.widget.TextView;

import java.util.Objects;

import app.test.shayariapp.adapter.homeAdapter;
import app.test.shayariapp.model.homeModel;

public class CategoryWiseShayri extends AppCompatActivity {
    RecyclerView recyclerView;
    homeModel[] homeModel;
    TextView textView;
    ImageView imageButton;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        //for system navigation bar hide
        //immersive mode
        View decorView = getWindow().getDecorView();
        int uiOptions = View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                | View.SYSTEM_UI_FLAG_FULLSCREEN
                | View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY;
        decorView.setSystemUiVisibility(uiOptions);
        //for system navigation bar hide
        //immersive mode
        //swipe karu tyare navigation bar dekhashe
        decorView.setSystemUiVisibility(View.SYSTEM_UI_FLAG_LAYOUT_STABLE);



        setContentView(R.layout.activity_category_wise_shayri);

        imageButton = findViewById(R.id.img_back);
        String data = getIntent().getExtras().getString("category_name");
        textView = findViewById(R.id.textView_appbar_category);
        textView.setText(data);
        imageButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                onBackPressed();
            }
        });
        if (Objects.equals(data, "જિંદગી શાયરી")) {
            homeModel = new homeModel[]
                    {
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "પ્રેમ શાયરી")) {
            homeModel = new homeModel[]
                    {
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "રોમેન્ટિક શાયરી")) {
            homeModel = new homeModel[]
                    {

                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),

                    };

        } else if (Objects.equals(data, "દુઃખ દાયક શાયરી")) {
            homeModel = new homeModel[]
                    {

                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),

                    };

        } else if (Objects.equals(data, "મિસ યુ શાયરી")) {
            homeModel = new homeModel[]
                    {

                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "દોસ્તી શાયરી")) {
            homeModel = new homeModel[]
                    {
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "માં-બાપ શાયરી")) {
            homeModel = new homeModel[]
                    {

                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "જન્મદિવસ શાયરી")) {
            homeModel = new homeModel[]
                    {
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "goog night શાયરી")) {
            homeModel = new homeModel[]
                    {
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else if (Objects.equals(data, "એટીટુડ શાયરી")) {
            homeModel = new homeModel[]
                    {

                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                            new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                            new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                            new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                            new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                            new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                            new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                    };

        } else {
            {
                homeModel = new homeModel[]
                        {

                                new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                                new homeModel("પળે પળ વીતે કેવી રીતે હું જ જાણું છું, ઘૂંટાયેલી ઘડીઓની વાત હું જ જાણું છું, એકલતા હોય કેવી એ મને સમજાય છે"),
                                new homeModel("મારે એ પૂછવું હતું કે આ ભૂખ ના લીધે પેટમાં ઉંદર દોડતા હોય છે ને..? તો એમાંથી કોઈ 1st કે 2nd પણ આવે છે કે બસ એમ જ દોડ્યા કરે છે"),
                                new homeModel("તને જન્મદિવસની ખૂબ ખૂબ શુભેચ્છાઓ અને આગામી વર્ષ માટેની શુભેચ્છાઓ. આવા સાચા મિત્ર બનવા બદલ આભાર!"),
                                new homeModel("❛ તમે પાંખો કાપી ને આભ અકબંધ રાખ્યું, ને એનું તે નામ તમે સંબંધ રાખ્યું. મારા સઘળાં દુવારને કરી દીધાં બંધ, ને આમ તમે આંખોને કરી દીધી અંધ. તમે કાંટાળા થોરનો આપ્યો મને સ્પર્શ, ને એનું તે નામ તમે સુગંધ રાખ્યું. હું તો વહેણમાં તણાઈ મને કાંઠો નથી, ને આપણા સંબંધની કોઈ ગાંઠો નથી. અછાંદસ જેવો છે આપણો આ પંથ, ને એનું તે નામ તમે છંદ રાખ્યું. ❜ - પન્ના નાયક"),
                                new homeModel("હું બધું જ જાણું છું પણ ચુપ છું, કોઈ પોતાના મતલબ માટે કેટલી હદ વટાવે એ જોવ છું\uD83D\uDE0E\n "),
                                new homeModel("હશે જો એને પ્રેમ \uD83D\uDC91 તો સામે થી આવશે એ.. પ્રેમ મા પાગલ બનાય દોસ્ત , ભીખારી નહી \uD83D\uDE06\n"),
                                new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"), new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                                new homeModel("મમ્મી: શું કરે છે બેટા?.. ચિન્ટુ: વાચુ છું મમ્મી.. મમ્મી: સરસ બેટા.. શું વાચે છે?.. ચિન્ટુ: તમારી આવનારી વહુના મેસેજ.. 4G ની સ્પીડે આવ્યું ચંપલ \uD83D\uDE02\uD83D\uDE02\uD83D\uDE02\uD83D\uDE1B\n"),
                        };

            }
        }
        recyclerView = findViewById(R.id.recyclerView_categorywise_shayri);
        recyclerView.setLayoutManager(new LinearLayoutManager(getApplicationContext()));
        //get application conrext karyu hatu this ni jagya a tyare ahiya crash tahto hato
        homeAdapter adapter = new homeAdapter(homeModel, this);
        recyclerView.setAdapter(adapter);
    }
    public void onWindowFocusChanged(boolean hasFocus) {
        super.onWindowFocusChanged(hasFocus);
        if (hasFocus) {
            View decorView = getWindow().getDecorView();
            decorView.setSystemUiVisibility(
                    View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                            | View.SYSTEM_UI_FLAG_FULLSCREEN
                            | View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY);
        }
    }
}